app/controllers/albarans_controller.rb

  def listado
    @albarans = Albaran.all
---
SELECT * FROM "albarans"

  def editar
    @albaran = params[:id] ?  Albaran.find(params[:id]) : nil
---
SELECT * FROM "albarans" WHERE ("albarans"."id" = 1)

  def modificar
    @albaran = params[:id] ?  Albaran.find(params[:id]) : Albaran.new
    @albaran.update_attributes params[:albaran]
---
SELECT * FROM "albarans" WHERE ("albarans"."id" = 1)
UPDATE "albarans" SET "updated_at" = '2011-02-17 16:48:56', "fecha" = '2011-02-04' WHERE "id" = 1