app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT * FROM "clientes"