app/controllers/familias_controller.rb

  def listado
    @familias = Familia.all
---
SELECT * FROM "familias"

  def editar
    @familia = params[:id] ?  Familia.find(params[:id]) : nil
    @ivas = Iva.all
---
SELECT * FROM "ivas"

  def borrar
    @familia = Familia.find(params[:id])
    @familia.destroy
---
SELECT * FROM "familias" WHERE ("familias"."id" = 2)
DELETE FROM "familias" WHERE "id" = 2