app/controllers/familias_controller.rb

  def index
    @familias = Familia.all
---
SELECT * FROM "familias"

  def show
    @familia = Familia.find(params[:id])
---
SELECT * FROM "familias" WHERE ("familias"."id" = 1)

  def edit
    @familia = Familia.find(params[:id])
---
SELECT * FROM "familias" WHERE ("familias"."id" = 1)

  def create
    @familia = Familia.new(params[:familia])

    respond_to do |format|
      if @familia.save
---
INSERT INTO "familias" ("created_at", "nombre", "updated_at", "iva_id") VALUES('2011-02-16 21:03:38', 'Libros de niños', '2011-02-16 21:03:38', NULL)