app/controllers/ivas_controller.rb

SELECT * FROM "ivas"
---
  def listado
    @ivas = Iva.all

INSERT INTO "ivas" ("created_at", "nombre", "updated_at", "valor") VALUES('2011-02-16 21:03:23', 'Libros', '2011-02-16 21:03:23', 5)
---
  def create
    @iva = Iva.new(params[:iva])

    respond_to do |format|
      if @iva.save

SELECT * FROM "ivas" WHERE ("ivas"."id" = 7)
---
  def editar
    @iva = params[:id] ?  Iva.find(params[:id]) : nil

SELECT * FROM "ivas" WHERE ("ivas"."id" = 9)
UPDATE "ivas" SET "updated_at" = '2011-02-17 15:44:49', "valor" = 12 WHERE "id" = 8
---
  def modificar
    @iva = params[:id] ?  Iva.find(params[:id]) : Iva.new
    @iva.update_attributes params[:iva]

SELECT * FROM "ivas" WHERE ("ivas"."id" = 2)
DELETE FROM "ivas" WHERE "id" = 2
---
  def borrar
    @iva = Iva.find(params[:id])
    @iva.destroy